-- person_group
INSERT INTO 
user_group (name)
VALUES
 ('Admin' ), --1 
 ('Worker' ), --2
 ('Student'); --3

 -- gender
INSERT INTO 
gender (name)
VALUES
('Муж'),--1
('Жен');--2

 -- curriculum
INSERT INTO 
curriculum (name, description)
VALUES
 ('Бакалавриат', 'Описание программы бакалавриат'),  -- 1
 ('Магистратура', 'Описание программы магистратура'),-- 2
 ('Докторантура', 'Описание программы Докторантура'); -- 3


 -- grade
INSERT INTO 
grade (name)
VALUES
 ('1-Курс'), -- 1
 ('2-Курс'), --2 
 ('3-Курс'), -- 3
 ('4-Курс'), -- 4
 ('5-Курс'); -- 5


  -- faculty
INSERT INTO 
faculty (name, description)
VALUES
 ('ФАКУЛЬТЕТ БИОЛОГИИ И БИОТЕХНОЛОГИИ', 'Здесь описание факультета'),-- 1
 ('ФАКУЛЬТЕТ ВОСТОКОВЕДЕНИЯ', 'Здесь описание факультета'), -- 2
 ('ФАКУЛЬТЕТ МЕЖДУНАРОДНЫХ ОТНОШЕНИЙ', 'Здесь описание факультета'), -- 3
 ('ФИЗИКО-ТЕХНИЧЕСКИЙ ФАКУЛЬТЕТ', 'Здесь описание факультета'), -- 4
 ('ВЫСШАЯ ШКОЛА ЭКОНОМИКИ И БИЗНЕСА', 'Здесь описание факультета'),-- 5
 ('ФАКУЛЬТЕТ ГЕОГРАФИИ И ПРИРОДО- ПОЛЬЗОВАНИЯ', 'Здесь описание факультета'), -- 6
 ('ФИЛОЛОГИЧЕСКИЙ ФАКУЛЬТЕТ', 'Здесь описание факультета'), --7
 ('ЮРИДИЧЕСКИЙ ФАКУЛЬТЕТ', 'Здесь описание факультета'), -- 8
 ('ФАКУЛЬТЕТ ЖУРНАЛИСТИКИ', 'Здесь описание факультета'), -- 9
 ('ФАКУЛЬТЕТ МЕДИЦИНЫ И ЗДРАВООХРАНЕНИЯ', 'Здесь описание факультета'),--10
 ('МЕХАНИКО-МАТЕМАТИЧЕСКИЙ ФАКУЛЬТЕТ', 'Здесь описание факультета'),--11
 ('ИСТОРИЧЕСКИЙ ФАКУЛЬТЕТ', 'Здесь описание факультета'), --12
 ('ФАКУЛЬТЕТ ХИМИИ И ХИМИЧЕСКОЙ ТЕХНОЛОГИИ', 'Здесь описание факультета'), --13
 ('ФАКУЛЬТЕТ ИНФОРМАЦИОННЫХ ТЕХНОЛОГИЙ', 'Здесь описание факультета'), -- 14
 ('ФАКУЛЬТЕТ ФИЛОСОФИИ И ПОЛИТОЛОГИИ', 'Здесь описание факультета'); --15

  -- speciality
INSERT INTO 
speciality (name,code,curriculum_id, description,faculty_id)
VALUES
 ('Информатика','5В060200',1, 'Описание специальности',14), -- 1
 ('Информационные системы','5В070300',1, 'Описание специальности',14), --2
 ('Вычислительная техника и программное обеспечение','5В070400',1, 'Описание специальности',14), --3
 ('Индустриальные информационные системы','6В06101',1, 'Описание специальности',14), --4
 ('Компьютерная инженерия','6В06103',1, 'Описание специальности',14), --5
 ('Компьютерные науки','6В06104',1, 'Описание специальности',14), --6
 ('Высоконагруженный информационные системы с искусственным интеллектом','6В06106',1, 'Описание специальности',14), --7
 ('Наука о данных','6В06107',1, 'Описание специальности',14), --8
 ('Системы информационной безопасности','5В100200',1, 'Описание специальности',14), --9
 ('Автоматизация и управление','5В070200',1, 'Описание специальности',14), --10
 ('Интернет вещей и Big data','6В07108',1, 'Описание специальности',14), --11
 ('Интеллектуальные системы управления','6В07113',1, 'Описание специальности',14); --12; 



  -- college_group
INSERT INTO 
college_group (name,grade_id, speciality_id)
VALUES
('И-2310',1,1),
('И-2311',1,1),
('И-2312',1,1),
('И-2313',1,1),
('ИC-2310',1,2),
('ИC-2311',1,2),
('ИC-2312',1,2),
('ИC-2313',1,2),
('ВТИПО-2310',1,3),
('ВТИПО-2311',1,3),
('ВТИПО-2312',1,3),
('ВТИПО-2313',1,3);

-- department
INSERT INTO 
department (name, description,faculty_id)
VALUES
 ('Кафедра Информационных систем', 'Здесь описание кафедры', 14), --1
 ('Кафедра Компьютерных наук', 'Здесь описание кафедры',14), --2
 ('Искусственный Интеллект и Big Data', 'Здесь описание кафедры',14); --3


  -- employee_position
INSERT INTO 
position (name)
VALUES
 ('Профессор'), --1
 ('Доцент'), --2
 ('Старший преподователь'), --3
 ('Преподователь'), --4
 ('Ассистент преподователя'), --5
 ('Декан'), --6
 ('Заведующий кафедрой'), --7
 ('Администратор ИТ'); --8




 --courses
 INSERT INTO
 course (name,shortname,credit_hours,
        theoretical_hours, experimental_hours,description, department_id )
VALUES
('Система управления базами данных', 'СУБД', 15,8,7, 'This is description', 1), --1
('Алгоритмы и структуры данных', 'АСД', 15,8,7, 'This is description', 1), -- 2
('Обработка изображений', 'ОС', 15,8,7, 'This is description', 1),--3
('Компьютерные сети', 'КС', 15,8,7, 'This is description', 1), -- 4
('Обработка цивровых сигналов', 'ОЦС', 15,8,7, 'This is description', 2), -- 5
('Кибербезопасность', 'КБ', 15,8,7, 'This is description', 2);--6





 -- student
INSERT INTO 
student (firstname,lastname,middlename,
        birthday,bio, picture,gender_id,
        email,phone,password,
        user_group_id, college_group_id)
VALUES
('Садыр','Сауытов', 'Сабыржанулы', '27-08-1997',
'This is bio','url_to_picture', 1, 'admin@gmail.com',
'87778888877', '12345', 1, 1 ),
('Ермек','Абдибай', 'Ернарулы', '27-08-1997',
'This is bio','url_to_picture', 1, 'ermek@gmail.com',
'87778888877', '12345', 3, 1 );

 -- student
INSERT INTO 
student (firstname,lastname,middlename,
        birthday,bio, picture,gender_id,
        email,phone,password,
        user_group_id, college_group_id)
VALUES
('Бобик','Лайков', 'Тузикович', '27-08-1997',
'This is bio','url_to_picture', 1, 'student@gmail.com',
'87778888877', '12345', 3, 1 );

 -- teacher
INSERT INTO 
teacher (firstname,lastname,middlename,
        birthday,bio, picture,gender_id,
        email,phone,password,
        user_group_id, department_id, position_id)
VALUES
('Маша','Ивановна', 'Блаловнга', '27-08-1987',
'This is bio','url_to_picture', 1, 'worker@gmail.com',
'87778888877', '12345', 2, 1 , 1), -- 1
('Айжан','Еркенова', 'Еркекызы', '27-08-1987',
'This is bio','url_to_picture', 1, ' aizhan@gmail.com',
'87778888877', '12345', 2, 2 , 1);-- 2


--teacher_course
INSERT INTO
teacher_course (teacher_id, course_id)
VALUES
(1,1),
(1,2),
(2,5),
(2,6);

--semester
INSERT INTO
semester (name, start_date, end_date)
VALUES
('1-Семестр  учебного года', '1 сентября учебного года', '31 декабря учебного года'),
('2-Семестр   учебного года', '22 января учебного года', '15 июня учебного года');

--control_point
INSERT INTO 
control_point (name, start_date, end_date)
VALUES
('1-рубежный контроль', 'temp', 'temp'),
('2-рубежный контроль', ' temp', 'temp'),
('Экзамен', ' temp', 'temp');

--day_of_week
INSERT INTO
day_of_week (name)
VALUES
('Понедельник'),
('Вторник'),
('Среда'),
('Четверг'),
('Пятница');

--lesson_time
INSERT INTO
lesson_time (name)
VALUES
('С 8-00 до 8-50'),
('С 9-00 до 9-50'),
('С 10-00 до 10-50'),
('С 11-00 до 11-50'),
('С 12-00 до 12-50'),
('С 13-00 до 13-50'),
('С 14-00 до 14-50'),
('С 15-00 до 15-50'),
('С 16-00 до 16-50'),
('С 17-00 до 17-50');

--lesson_type
INSERT INTO
lesson_type (name)
VALUES
('Лекция'),
('Семинар'),
('Лабороторная работа');









