-- person_group
INSERT INTO 
person_group (name)
VALUES
 ('Admin' ), --1 
 ('Worker' ), --2
 ('Student'); --3

-- gender
INSERT INTO 
gender (name)
VALUES
('Муж'),--1
('Жен');--2

 -- curriculum
INSERT INTO 
curriculum (name, description)
VALUES
 ('Бакалавриат', 'Описание программы бакалавриат'),  -- 1
 ('Магистратура', 'Описание программы магистратура'),-- 2
 ('Докторантура', 'Описание программы Докторантура'); -- 3

-- grade
INSERT INTO 
grade (name)
VALUES
 (1), -- 1
 (2), --2 
 (3), -- 3
 (4), -- 4
 (5); -- 5


 
  -- faculty
INSERT INTO 
faculty (name, description)
VALUES
 ('ФАКУЛЬТЕТ БИОЛОГИИ И БИОТЕХНОЛОГИИ', 'Здесь описание факультета'),-- 1
 ('ФАКУЛЬТЕТ ВОСТОКОВЕДЕНИЯ', 'Здесь описание факультета'), -- 2
 ('ФАКУЛЬТЕТ МЕЖДУНАРОДНЫХ ОТНОШЕНИЙ', 'Здесь описание факультета'), -- 3
 ('ФИЗИКО-ТЕХНИЧЕСКИЙ ФАКУЛЬТЕТ', 'Здесь описание факультета'), -- 4
 ('ВЫСШАЯ ШКОЛА ЭКОНОМИКИ И БИЗНЕСА', 'Здесь описание факультета'),-- 5
 ('ФАКУЛЬТЕТ ГЕОГРАФИИ И ПРИРОДО- ПОЛЬЗОВАНИЯ', 'Здесь описание факультета'), -- 6
 ('ФИЛОЛОГИЧЕСКИЙ ФАКУЛЬТЕТ', 'Здесь описание факультета'), --7
 ('ЮРИДИЧЕСКИЙ ФАКУЛЬТЕТ', 'Здесь описание факультета'), -- 8
 ('ФАКУЛЬТЕТ ЖУРНАЛИСТИКИ', 'Здесь описание факультета'), -- 9
 ('ФАКУЛЬТЕТ МЕДИЦИНЫ И ЗДРАВООХРАНЕНИЯ', 'Здесь описание факультета'),--10
 ('МЕХАНИКО-МАТЕМАТИЧЕСКИЙ ФАКУЛЬТЕТ', 'Здесь описание факультета'),--11
 ('ИСТОРИЧЕСКИЙ ФАКУЛЬТЕТ', 'Здесь описание факультета'), --12
 ('ФАКУЛЬТЕТ ХИМИИ И ХИМИЧЕСКОЙ ТЕХНОЛОГИИ', 'Здесь описание факультета'), --13
 ('ФАКУЛЬТЕТ ИНФОРМАЦИОННЫХ ТЕХНОЛОГИЙ', 'Здесь описание факультета'), -- 14
 ('ФАКУЛЬТЕТ ФИЛОСОФИИ И ПОЛИТОЛОГИИ', 'Здесь описание факультета'); --15

 -- speciality
INSERT INTO 
speciality (name,code,curriculum_id, description,faculty_id)
VALUES
 ('Информатика','5В060200',1, 'Описание специальности',14), -- 1
 ('Информационные системы','5В070300',1, 'Описание специальности',14), --2
 ('Вычислительная техника и программное обеспечение','5В070400',1, 'Описание специальности',14), --3
 ('Индустриальные информационные системы','6В06101',1, 'Описание специальности',14), --4
 ('Компьютерная инженерия','6В06103',1, 'Описание специальности',14), --5
 ('Компьютерные науки','6В06104',1, 'Описание специальности',14), --6
 ('Высоконагруженный информационные системы с искусственным интеллектом','6В06106',1, 'Описание специальности',14), --7
 ('Наука о данных','6В06107',1, 'Описание специальности',14), --8
 ('Системы информационной безопасности','5В100200',1, 'Описание специальности',14), --9
 ('Автоматизация и управление','5В070200',1, 'Описание специальности',14), --10
 ('Интернет вещей и Big data','6В07108',1, 'Описание специальности',14), --11
 ('Интеллектуальные системы управления','6В07113',1, 'Описание специальности',14); --12; 

  -- college_group
INSERT INTO 
college_group (name,grade_id, speciality_id)
VALUES
('И-2310',1,1),
('И-2311',1,1),
('И-2312',1,1),
('И-2313',1,1),
('ИC-2310',1,2),
('ИC-2311',1,2),
('ИC-2312',1,2),
('ИC-2313',1,2),
('ВТИПО-2310',1,3),
('ВТИПО-2311',1,3),
('ВТИПО-2312',1,3),
('ВТИПО-2313',1,3);


-- department
INSERT INTO 
department (name, description,faculty_id)
VALUES
 ('Кафедра Информационных систем', 'Здесь описание кафедры', 14), --1
 ('Кафедра Компьютерных наук', 'Здесь описание кафедры',14), --2
 ('Искусственный Интеллект и Big Data', 'Здесь описание кафедры',14); --3

 -- position_category
INSERT INTO 
position_category (name)
VALUES
 ('Профессорско-преподавательский состав'), --1
 ('Административно управленческий персонал'); --2

  -- employee_position
INSERT INTO 
employee_position (name, position_category_id)
VALUES
 ('Профессор', 1), --1
 ('Доцент', 1), --2
 ('Старший преподователь', 1), --3
 ('Преподователь', 1), --4
 ('Ассистент преподователя', 1), --5
 ('Декан', 1), --6
 ('Заведующий кафедрой', 1), --7
 ('Администратор ИТ', 2); --8

 -- person
INSERT INTO 
person (firstname,lastname,midlename,birthday,bio, picture,gender_id,
email,password,phone_number,person_group_id)
VALUES
('Феликс','Кузнецов','Иванович','2023-01-01','This is bio','url for picture',1,'felix@gmail.com', 'password','87778887788',3),
('Артемий','Захарченко','Григорьевич','2023-01-01','This is bio','url for picture',1,'artemii@gmail.com', 'password','87778887788',3),
('Осип','Беляков','Васильевич','2023-01-01','This is bio','url for picture',1,'osipr@gmail.com', 'password','87778887788',3),
('Чарльз','Темченко','Васильевич','2023-01-01','This is bio','url for picture',1,'temd@gmail.com', 'password','87778887788',3),
('Чарльз','Ситников','Артёмович','2023-01-01','This is bio','url for picture',1,'charlss@gmail.com', 'password','87778887788',3),
('Оливер','Кабанов','Валериевич','2023-01-01','This is bio','url for picture',1,'olipben@gmail.com', 'password','87778887788',3),
('Харитон','Быков','Львович','2023-01-01','This is bio','url for picture',1,'fmfmfld@gmail.com', 'password','87778887788',3),
('Радислав','Семёнов','Сергеевич','2023-01-01','This is bio','url for picture',1,'fmkkflrfm@gmail.com', 'password','87778887788',3),
('Любомир','Семёнов','Алексеевич','2023-01-01','This is bio','url for picture',1,'kgfkfklrl@gmail.com', 'password','87778887788',3),
('Леонид','Пилипейко','Ярославович','2023-01-01','This is bio','url for picture',1,'kmmkvm@gmail.com', 'password','87778887788',3),
('Доминика','Яковлева','Петровна','2023-01-01','This is bio','url for picture',2,'fnfndmko@gmail.com', 'password','87778887788',3),
('Алёна','Мясникова','Платоновна','2023-01-01','This is bio','url for picture',2,'fnfnfkdo@gmail.com', 'password','87778887788',3),
('Инесса','Ларионова','Богдановна','2023-01-01','This is bio','url for picture',2,'kodfodox@gmail.com', 'password','87778887788',3),
('Анжелика','Недбайло','Дмитриевна','2023-01-01','This is bio','url for picture',2,'jkdjkckcr@gmail.com', 'password','87778887788',3),
('Нелли','Зимина','Александровна','2023-01-01','This is bio','url for picture',2,'fttrccre@gmail.com', 'password','87778887788',3),
('Яэль','Ялова','Александровна','2023-01-01','This is bio','url for picture',2,'gv5trkc@gmail.com', 'password','87778887788',3),
('Янина','Филиппова','Артёмовна','2023-01-01','This is bio','url for picture',2,'rekckrc@gmail.com', 'password','87778887788',3),
('Люся','Терентьева','Виталиевна','2023-01-01','This is bio','url for picture',2,'fclplklckp@gmail.com', 'password','87778887788',3),
('Шушана','Жукова','Григорьевна','2023-01-01','This is bio','url for picture',2,'fpkl4rckp@gmail.com', 'password','87778887788',3),
('Кондратьева','Ярослава','Викторовна','2023-01-01','This is bio','url for picture',2,'k4rklclkr@gmail.com', 'password','87778887788',3),
('Admin','Admin','Admin','2023-01-01','This is bio','url for picture',1,'admin@gmail.com', 'password','87778887788',1),
('Ростислав','Крылов','Максимович','2023-01-01','This is bio','url for picture',2,'jtnft5jf@gmail.com', 'password','87778887788',2),
('Пётр','Игнатьев','Максимович','2023-01-01','This is bio','url for picture',2,'iof0ij0ff@gmail.com', 'password','87778887788',2),
('Эдуард','Комаров','Платонович','2023-01-01','This is bio','url for picture',2,'komf4m4iot@gmail.com', 'password','87778887788',2),
('Харитон','Марков','Андреевич','2023-01-01','This is bio','url for picture',2,'4okf4ropfk4ld@gmail.com', 'password','87778887788',2),
('Суворов','Тит','Станиславович','2023-01-01','This is bio','url for picture',2,'4poprkorkf@gmail.com', 'password','87778887788',2),
('Зыков','Йошка','Викторович','2023-01-01','This is bio','url for picture',2,'kfkm4rimf4r@gmail.com', 'password','87778887788',2),
('Савенко','Ленар','Викторович','2023-01-01','This is bio','url for picture',2,'4orkfiorfkm@gmail.com', 'password','87778887788',2),
('Чечилия','Горбунова','Виталиевна','2023-01-01','This is bio','url for picture',2,'jdjjfkoriom@gmail.com', 'password','87778887788',2),
('Эдита','Стрелкова','Анатолиевна','2023-01-01','This is bio','url for picture',2,'kovkormkoecm@gmail.com', 'password','87778887788',2),
('Юнона','Овчаренко','Фёдоровна','2023-01-01','This is bio','url for picture',2,'kmcvkomkom@gmail.com', 'password','87778887788',2),
('Искра','Аксёнова','Платоновна','2023-01-01','This is bio','url for picture',2,'okimcmor@gmail.com', 'password','87778887788',2),
('Любовь','Рымар','Ивановна','2023-01-01','This is bio','url for picture',2,'lpcjkncnrc@gmail.com', 'password','87778887788',2),
('Лидия','Сердюк','Валериевна','2023-01-01','This is bio','url for picture',2,'cemcemco@gmail.com', 'password','87778887788',2),
('Ягетта','Ларионова','Дмитриевна','2023-01-01','This is bio','url for picture',2,'krcmikpkplm@gmail.com', 'password','87778887788',2),
('Лада','Моисеенко','Станиславовна','2023-01-01','This is bio','url for picture',2,'omcrmciocm@gmail.com', 'password','87778887788',2);






